### Pandas A-Z

# Pandas Cookbook with Questions and Answers
<img src = "images/logo.jpg" width="100" align="left">

<br><br><br><br>Ram Narasimhan

# About the Cookbook

For all data analysis tasks using Python, the Pandas module is used quite extensively. I have created this "Cookbook" so that new learners can use it as a reference for all the common tasks that go along with Data Analysis using Python.

Just refer to the Table of Contents and click the link to get your answers.

This Notebook is divided into multiple sections by concept.

In [267]:
import numpy as np #a new module
import pandas as pd #we will see this more and more
import matplotlib.pyplot as plt #plotting module
import seaborn as sns # Seaborn for plotting and styling
sns.set(color_codes=True)

#shows the graphs in the Notebook itself. (INLINE)
%matplotlib inline

### Data Files

For most of the questions, we will be using `example.csv` (in the `data` folder) as the main data file. It has some dummy data to help understand the concepts.

# Table of Contents

## Part 1: Reading, Writing and Creating Data Frame

- **1.1 How to read a CSV file as a Pandas data frame?**
- **1.2 How to quickly create a Data frame and specify the columns?**
- **1.3 How to copy a data frame into another name?**
- **1.4 How to WRITE a data frame to a CSV file?**

## Part 2: Viewing sections of the Data Frame

- **2.1 View the number of rows and columns in a data frame**
- **2.2 View the top few rows, bottom few rows of the data frame**
- **2.3 View the list of columns in a data frame**
- **2.4 View the Index of a data frame**
- **2.5 Describe all the numerical columns of a data frame **

## Part 3: Interacting with Data Frame Columns

- **3.1 View the content of one particular column, if you know its name**
- **3.2 Create a new column, based on some existing columns **
- How to find the data types of each column in a data frame?
- How to find the max() or min() of a column?
- How to count the number of unique values in one column?
- How to count the frequency of *each* unique value in one column?
- How to rename columns?
- How to Drop a column?
- How to rearrange the columns in a data frame?

## Part 4: Working with the Index

- ** How to make one of the columns into the new Index?
- ** How to print the entire row at a particular value of Index?
- ** 4.3 How to specify the column to be the index, when reading in a CSV file?

## Part 5: Selecting and Subsetting (with Boolean Masks)

- ** How to make one of the columns into the new Index?
- ** How to print the entire row at a particular value of Index?
- ** 4.3 How to specify the column to be the index, when reading in a CSV file?

## Part 6: Working with DateTime and DateTimeIndex

### 6.1 How to convert a column from string to `datetime`? 
### 6.2 How to select the hour, date, month and year from a `datetime` column?
### 6.3 How to make a datetime column to be the Index?
### 6.4 How to select a time slice of the data frame, based on DateTimeIndex?

### 6.5 How to resample (aggregate) over different time periods? To get monthly/daily averages?

# Part 7: Dealing with Missing Data

### 7.1 How to print all the rows (indices) where one particular column has missing values?

### 7.2 Count the number of Missing values in one Column

### 7.3 How to drop the rows that contain at least one missing value?

----
# <div class="alert-success">Solutions
 
</div>

## Part 1: Reading, Writing and Creating Data Frame

In [268]:
#- **1.1 How to read a CSV file as a Pandas data frame?**
df = pd.read_csv("data/example.csv")

In [269]:
df

       Date   Time Col One  Temp   Names  Pressure_psi
0  2/3/2019   9:01    Zero  21.9    John        14.900
1  2/3/2019  13:22    One   34.2    Mary           NaN
2  2/3/2019  14:58     Two  28.0    John        14.700
3  2/3/2019  17:31   Three  29.4   Peter        14.669
4  2/7/2019   8:29    Four  12.0     Ali        14.810
5  3/3/2019  11:11    Five  14.5    Baba        14.730
6  3/3/2019  13:08     Six  40.9     NaN        14.270
7  3/3/2019   9:01   Seven  35.5     NaN        14.900
8  3/3/2019   7:33   Eight  23.2  Mariam        14.880
9  3/3/2019  14:29    Nine  38.6   Merry        14.710

In [270]:
#- **1.2 How to quickly create a Data frame and specify the columns?**
df2 = pd.DataFrame({'col1':range(10), 'col2': np.random.randint(10, 100, size=10)})

In [271]:
df2.head()

   col1  col2
0     0    34
1     1    17
2     2    86
3     3    74
4     4    99

In [272]:
#- **1.3 How to copy a data frame into another name?**
dfcopy = df.copy()
#If you plan on modifying an extracted data frame, its a good idea to make a copy.

In [273]:
#- **1.4 How to WRITE a data frame to a CSV file?**
df2.to_csv("data/newdatafile.csv") #will end up in the data directory under the given name.

## Part 2: Viewing sections of the Data Frame

In [274]:
#- **2.1 View the number of rows and columns in a data frame**
df.shape # note that there is no brackets. Shape does not take any arguments

(10, 6)

In [275]:
#- **2.2 View the top few rows, bottom few rows of the data frame**
df.head()

       Date   Time Col One  Temp  Names  Pressure_psi
0  2/3/2019   9:01    Zero  21.9   John        14.900
1  2/3/2019  13:22    One   34.2   Mary           NaN
2  2/3/2019  14:58     Two  28.0   John        14.700
3  2/3/2019  17:31   Three  29.4  Peter        14.669
4  2/7/2019   8:29    Four  12.0    Ali        14.810

In [276]:
#- **2.2 View the top few rows, bottom few rows of the data frame**
df.tail()

       Date   Time Col One  Temp   Names  Pressure_psi
5  3/3/2019  11:11    Five  14.5    Baba         14.73
6  3/3/2019  13:08     Six  40.9     NaN         14.27
7  3/3/2019   9:01   Seven  35.5     NaN         14.90
8  3/3/2019   7:33   Eight  23.2  Mariam         14.88
9  3/3/2019  14:29    Nine  38.6   Merry         14.71

In [277]:
#- **2.3 View the list of columns in a data frame**
df.columns

Index(['Date', 'Time', 'Col One', 'Temp', 'Names', 'Pressure_psi'], dtype='object')

In [278]:
#if you want to get the column name, just do
df.columns[2]

'Col One'

In [279]:
#- **2.4 View the content of one particular column, if you know its name**
df['Names']

0      John
1      Mary
2      John
3     Peter
4       Ali
5      Baba
6       NaN
7       NaN
8    Mariam
9     Merry
Name: Names, dtype: object

In [280]:
#- **2.5 View the Index of a data frame**
df.index

RangeIndex(start=0, stop=10, step=1)

## Part 3: Interacting with Data Frame Columns

- **3.1 View the content of one particular column, if you know its name**

In [281]:
df['Col One']

0     Zero
1     One
2      Two
3    Three
4     Four
5     Five
6      Six
7    Seven
8    Eight
9     Nine
Name: Col One, dtype: object

- **3.2 Create a new column, based on some existing columns **

In [282]:
df['New Column'] = df['Col One'] + " " +  df['Names']
df['IntegerTemp'] = df['Temp'].astype(int)
df

,Date,Time,Col One,Temp,Names,Pressure_psi,New Column,IntegerTemp
0,2/3/2019,9:01,Zero,21.9,John,14.900,Zero John,21
1,2/3/2019,13:22,One,34.2,Mary,NaN,One Mary,34
2,2/3/2019,14:58,Two,28.0,John,14.700,Two John,28
3,2/3/2019,17:31,Three,29.4,Peter,14.669,Three Peter,29
4,2/7/2019,8:29,Four,12.0,Ali,14.810,Four Ali,12
5,3/3/2019,11:11,Five,14.5,Baba,14.730,Five Baba,14
6,3/3/2019,13:08,Six,40.9,NaN,14.270,NaN,40
7,3/3/2019,9:01,Seven,35.5,NaN,14.900,NaN,35
8,3/3/2019,7:33,Eight,23.2,Mariam,14.880,Eight Mariam,23
9,3/3/2019,14:29,Nine,38.6,Merry,14.710,Nine Merry,38

- How to find the data types of each column in a data frame?

In [283]:
df.dtypes # will print the data type of each column in your data frame. (Object usually means a string type)

Date             object
Time             object
Col One          object
Temp            float64
Names            object
Pressure_psi    float64
New Column       object
IntegerTemp       int32
dtype: object

How to find the max() or min() of a column?

In [284]:
df['Temp'].min(), df['IntegerTemp'].max()

(12.0, 40)

### 3.4 How to count the number of unique values in one column?

In [285]:
df['Date'].unique()
# there are 3 different dates in the data frame

array(['2/3/2019', '2/7/2019', '3/3/2019'], dtype=object)

### 3.5 How to count the frequency of *each* unique value in one column?

In [286]:
df['Date'].value_counts()

3/3/2019    5
2/3/2019    4
2/7/2019    1
Name: Date, dtype: int64

### 3.6 How to rename columns?

In [287]:
df.rename(columns={'Col One': 'NewCol1'}, inplace = True)
df

,Date,Time,NewCol1,Temp,Names,Pressure_psi,New Column,IntegerTemp
0,2/3/2019,9:01,Zero,21.9,John,14.900,Zero John,21
1,2/3/2019,13:22,One,34.2,Mary,NaN,One Mary,34
2,2/3/2019,14:58,Two,28.0,John,14.700,Two John,28
3,2/3/2019,17:31,Three,29.4,Peter,14.669,Three Peter,29
4,2/7/2019,8:29,Four,12.0,Ali,14.810,Four Ali,12
5,3/3/2019,11:11,Five,14.5,Baba,14.730,Five Baba,14
6,3/3/2019,13:08,Six,40.9,NaN,14.270,NaN,40
7,3/3/2019,9:01,Seven,35.5,NaN,14.900,NaN,35
8,3/3/2019,7:33,Eight,23.2,Mariam,14.880,Eight Mariam,23
9,3/3/2019,14:29,Nine,38.6,Merry,14.710,Nine Merry,38

In [288]:
type(df['IntegerTemp'])

pandas.core.series.Series

### 3. xHow to Drop a column?

In [289]:
df.drop('Names', axis=1)
#df.drop('Names', axis=1, inplace=True) # the inplace argument being set to True would make the change permanent. 
#That column would be gone.

       Date   Time NewCol1  Temp  Pressure_psi    New Column  IntegerTemp
0  2/3/2019   9:01    Zero  21.9        14.900     Zero John           21
1  2/3/2019  13:22    One   34.2           NaN     One  Mary           34
2  2/3/2019  14:58     Two  28.0        14.700      Two John           28
3  2/3/2019  17:31   Three  29.4        14.669   Three Peter           29
4  2/7/2019   8:29    Four  12.0        14.810      Four Ali           12
5  3/3/2019  11:11    Five  14.5        14.730     Five Baba           14
6  3/3/2019  13:08     Six  40.9        14.270           NaN           40
7  3/3/2019   9:01   Seven  35.5        14.900           NaN           35
8  3/3/2019   7:33   Eight  23.2        14.880  Eight Mariam           23
9  3/3/2019  14:29    Nine  38.6        14.710    Nine Merry           38

### 3.x How to rearrange the columns in a data frame?

In [290]:
neworder  = ['Time', 'Date', 'NewCol1', 'Temp', 'Pressure_psi', 'Names', 'IntegerTemp']
df = df[neworder]
df

    Time      Date NewCol1  Temp  Pressure_psi   Names  IntegerTemp
0   9:01  2/3/2019    Zero  21.9        14.900    John           21
1  13:22  2/3/2019    One   34.2           NaN    Mary           34
2  14:58  2/3/2019     Two  28.0        14.700    John           28
3  17:31  2/3/2019   Three  29.4        14.669   Peter           29
4   8:29  2/7/2019    Four  12.0        14.810     Ali           12
5  11:11  3/3/2019    Five  14.5        14.730    Baba           14
6  13:08  3/3/2019     Six  40.9        14.270     NaN           40
7   9:01  3/3/2019   Seven  35.5        14.900     NaN           35
8   7:33  3/3/2019   Eight  23.2        14.880  Mariam           23
9  14:29  3/3/2019    Nine  38.6        14.710   Merry           38

## Part 4: Working with the Data Frame Index

In [291]:
df.set_index('Names')
#df.set_index('Names', inplace = True) #this would make the change permanent

         Time      Date NewCol1  Temp  Pressure_psi  IntegerTemp
Names
John     9:01  2/3/2019    Zero  21.9        14.900           21
Mary    13:22  2/3/2019    One   34.2           NaN           34
John    14:58  2/3/2019     Two  28.0        14.700           28
Peter   17:31  2/3/2019   Three  29.4        14.669           29
Ali      8:29  2/7/2019    Four  12.0        14.810           12
Baba    11:11  3/3/2019    Five  14.5        14.730           14
NaN     13:08  3/3/2019     Six  40.9        14.270           40
NaN      9:01  3/3/2019   Seven  35.5        14.900           35
Mariam   7:33  3/3/2019   Eight  23.2        14.880           23
Merry   14:29  3/3/2019    Nine  38.6        14.710           38

### 4.2 Print the rows that have the index values of 5 and 6

In [292]:
df.iloc[5:7] #iloc[] is for integer location of the row number, starting from 0

    Time      Date NewCol1  Temp  Pressure_psi Names  IntegerTemp
5  11:11  3/3/2019    Five  14.5         14.73  Baba           14
6  13:08  3/3/2019     Six  40.9         14.27   NaN           40

### 4.3 Specify a column to be the index, when reading the CSV file

In [293]:
pd.read_csv("data/example.csv", index_col=['Names'])
#dfi = pd.read_csv("data/example.csv", index_col=['Names'])

            Date   Time Col One  Temp  Pressure_psi
Names
John    2/3/2019   9:01    Zero  21.9        14.900
Mary    2/3/2019  13:22    One   34.2           NaN
John    2/3/2019  14:58     Two  28.0        14.700
Peter   2/3/2019  17:31   Three  29.4        14.669
Ali     2/7/2019   8:29    Four  12.0        14.810
Baba    3/3/2019  11:11    Five  14.5        14.730
NaN     3/3/2019  13:08     Six  40.9        14.270
NaN     3/3/2019   9:01   Seven  35.5        14.900
Mariam  3/3/2019   7:33   Eight  23.2        14.880
Merry   3/3/2019  14:29    Nine  38.6        14.710

## Part 6: Working with DateTime and DateTimeIndex

1. ### How to convert a column from string to `datetime`?

In [294]:
#First, let's verify that the Date column is actually a string (object)
df['Date'].dtype

dtype('O')

Since the column is a string, we need to convert it to a `datetime` object. If we do that, a number of time related functions will be available to us for ready use.

In [295]:
#let us combine the two columns in one new column, called "DateTime" (it is still a string)
df['DateTime'] = df['Date'] + " " + df['Time']

In [296]:
df['DateTime'].head() #verify that it worked okay

0     2/3/2019 9:01
1    2/3/2019 13:22
2    2/3/2019 14:58
3    2/3/2019 17:31
4     2/7/2019 8:29
Name: DateTime, dtype: object

**Optional step**: If we don't want the 'Date' and 'Time' columns anymore, we can drop them from the dataframe.
Remember to use `inplace=True` and `axis=1`

In [297]:
df.drop(['Time', 'Date'], axis=1, inplace=True)

In [298]:
pd.to_datetime(df['DateTime'], format="%m/%d/%Y %H:%M")

0   2019-02-03 09:01:00
1   2019-02-03 13:22:00
2   2019-02-03 14:58:00
3   2019-02-03 17:31:00
4   2019-02-07 08:29:00
5   2019-03-03 11:11:00
6   2019-03-03 13:08:00
7   2019-03-03 09:01:00
8   2019-03-03 07:33:00
9   2019-03-03 14:29:00
Name: DateTime, dtype: datetime64[ns]

Important: Notice that the dtype has now become datetime (no longer an object/string)

The various details of the format conversion (%M %H etc.) are clearly specified here: 

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [299]:
df['DateTime'] = pd.to_datetime(df['DateTime'])

1. ### How to get the hour, date, month and year from a `datetime` column?

In [300]:
df['DateTime'].dt.hour
df['DateTime'].dt.day
df['DateTime'].dt.date
df['DateTime'].dt.year
df['DateTime'].dt.minute

0     1
1    22
2    58
3    31
4    29
5    11
6     8
7     1
8    33
9    29
Name: DateTime, dtype: int64

In [301]:
df['hour'] = df['DateTime'].dt.hour

1. ### How to make a datetime column to be the Index?

In [302]:
df.set_index('DateTime', inplace=True)

In [303]:
df.index #notice that it is now a `DateTimeIndex`

DatetimeIndex(['2019-02-03 09:01:00', '2019-02-03 13:22:00',
               '2019-02-03 14:58:00', '2019-02-03 17:31:00',
               '2019-02-07 08:29:00', '2019-03-03 11:11:00',
               '2019-03-03 13:08:00', '2019-03-03 09:01:00',
               '2019-03-03 07:33:00', '2019-03-03 14:29:00'],
              dtype='datetime64[ns]', name='DateTime', freq=None)

1. ### How to select a time slice of the data frame, based on DateTimeIndex?

In [304]:
df['2019-02'] # Get all the rows for February 2019

                    NewCol1  Temp  Pressure_psi  Names  IntegerTemp  hour
DateTime
2019-02-03 09:01:00    Zero  21.9        14.900   John           21     9
2019-02-03 13:22:00    One   34.2           NaN   Mary           34    13
2019-02-03 14:58:00     Two  28.0        14.700   John           28    14
2019-02-03 17:31:00   Three  29.4        14.669  Peter           29    17
2019-02-07 08:29:00    Four  12.0        14.810    Ali           12     8

In [305]:
df['2019-02-03'] # for one single date
#Remember: This will only work if you have made the dataframe Index to be datetime

                    NewCol1  Temp  Pressure_psi  Names  IntegerTemp  hour
DateTime
2019-02-03 09:01:00    Zero  21.9        14.900   John           21     9
2019-02-03 13:22:00    One   34.2           NaN   Mary           34    13
2019-02-03 14:58:00     Two  28.0        14.700   John           28    14
2019-02-03 17:31:00   Three  29.4        14.669  Peter           29    17

In [306]:
df['2019-02': '2019-03'] #between time periods, both ends are included.

                    NewCol1  Temp  Pressure_psi   Names  IntegerTemp  hour
DateTime
2019-02-03 09:01:00    Zero  21.9        14.900    John           21     9
2019-02-03 13:22:00    One   34.2           NaN    Mary           34    13
2019-02-03 14:58:00     Two  28.0        14.700    John           28    14
2019-02-03 17:31:00   Three  29.4        14.669   Peter           29    17
2019-02-07 08:29:00    Four  12.0        14.810     Ali           12     8
2019-03-03 11:11:00    Five  14.5        14.730    Baba           14    11
2019-03-03 13:08:00     Six  40.9        14.270     NaN           40    13
2019-03-03 09:01:00   Seven  35.5        14.900     NaN           35     9
2019-03-03 07:33:00   Eight  23.2        14.880  Mariam           23     7
2019-03-03 14:29:00    Nine  38.6        14.710   Merry           38    14

- ### How to resample (aggregate) over different time periods?

'M' is for monthly, and 'D' is for daily level resampling.

We resample the whole dataframe by given time increments (daily, monthly, hourly etc) and then select one column and apply a mathematical function to it. In the following examples, we select the 'Temp' column and calculate it mean or max

In [307]:
df.resample('M')['Temp'].max()

DateTime
2019-02-28    34.2
2019-03-31    40.9
Freq: M, Name: Temp, dtype: float64

In [308]:
df.resample('D')['Temp'].mean()

DateTime
2019-02-03    28.375
2019-02-04       NaN
2019-02-05       NaN
2019-02-06       NaN
2019-02-07    12.000
2019-02-08       NaN
2019-02-09       NaN
2019-02-10       NaN
2019-02-11       NaN
2019-02-12       NaN
2019-02-13       NaN
2019-02-14       NaN
2019-02-15       NaN
2019-02-16       NaN
2019-02-17       NaN
2019-02-18       NaN
2019-02-19       NaN
2019-02-20       NaN
2019-02-21       NaN
2019-02-22       NaN
2019-02-23       NaN
2019-02-24       NaN
2019-02-25       NaN
2019-02-26       NaN
2019-02-27       NaN
2019-02-28       NaN
2019-03-01       NaN
2019-03-02       NaN
2019-03-03    30.540
Freq: D, Name: Temp, dtype: float64

# Part 7: Dealing with Missing Data

### How to print all the rows (indices) where one particular column has missing values?

In [311]:
df

                    NewCol1  Temp  Pressure_psi   Names  IntegerTemp  hour
DateTime
2019-02-03 09:01:00    Zero  21.9        14.900    John           21     9
2019-02-03 13:22:00    One   34.2           NaN    Mary           34    13
2019-02-03 14:58:00     Two  28.0        14.700    John           28    14
2019-02-03 17:31:00   Three  29.4        14.669   Peter           29    17
2019-02-07 08:29:00    Four  12.0        14.810     Ali           12     8
2019-03-03 11:11:00    Five  14.5        14.730    Baba           14    11
2019-03-03 13:08:00     Six  40.9        14.270     NaN           40    13
2019-03-03 09:01:00   Seven  35.5        14.900     NaN           35     9
2019-03-03 07:33:00   Eight  23.2        14.880  Mariam           23     7
2019-03-03 14:29:00    Nine  38.6        14.710   Merry           38    14

In [310]:
df['Pressure_psi'].unique()

array([14.9  ,    nan, 14.7  , 14.669, 14.81 , 14.73 , 14.27 , 14.88 ,
       14.71 ])

In [309]:
df['Pressure_psi'].isnull()

DateTime
2019-02-03 09:01:00    False
2019-02-03 13:22:00     True
2019-02-03 14:58:00    False
2019-02-03 17:31:00    False
2019-02-07 08:29:00    False
2019-03-03 11:11:00    False
2019-03-03 13:08:00    False
2019-03-03 09:01:00    False
2019-03-03 07:33:00    False
2019-03-03 14:29:00    False
Name: Pressure_psi, dtype: bool

### 7.1 Count the number of Missing values in one Column

In [320]:
df['Pressure_psi'].isnull().sum() # 1 missing
df['Names'].isnull().sum()

2

### How to drop the rows that contain at least one missing value?

In [321]:
df.dropna()
# 3 rows got dropped. This is because they had at least one Nan or NULL value.

                    NewCol1  Temp  Pressure_psi   Names  IntegerTemp  hour
DateTime
2019-02-03 09:01:00    Zero  21.9        14.900    John           21     9
2019-02-03 14:58:00     Two  28.0        14.700    John           28    14
2019-02-03 17:31:00   Three  29.4        14.669   Peter           29    17
2019-02-07 08:29:00    Four  12.0        14.810     Ali           12     8
2019-03-03 11:11:00    Five  14.5        14.730    Baba           14    11
2019-03-03 07:33:00   Eight  23.2        14.880  Mariam           23     7
2019-03-03 14:29:00    Nine  38.6        14.710   Merry           38    14

In [313]:
df.shape, df.dropna().shape

((10, 6), (7, 6))

# Part 8:

# Part 9: Plotting with Pandas

In [ ]:
mpl_plot = plt.plot(df.x, df.y, 'k')
plt.title("matplotlib xy line plot")

### 1.2 Create same plot using Pandas

In [ ]:
pandas_plot = df.plot('x', 'y', color='k')
plt.title("Pandas Plot");

### 1.3 Create A Seaborn Plot

In [ ]:
seaborn_plot = sns.FacetGrid(df,  size=3, aspect= 2) #get the basic grid ready. Things can be 'mapped' onto this grid
seaborn_plot.map(plt.scatter, "x", "y")
seaborn_plot.map(plt.plot, "x", "y")
sns.plt.title("Seaborn Plot");

## Part 2: Save all 3 plots

### Save a `matplotlib` Plot

In [ ]:
mpl_plot = plt.plot(df.x, df.y, 'k')
plt.title("matplotlib xy line plot")
plt.savefig("output/matplotlib_plot.png")
plt.close() #don't display the image here

In [98]:
# This is a bit more complicated. If you have the mpl plot stored as a variable, you have to first get the figure and then plot it.

for p in mpl_plot: #this is needed because mpl_plot is a list
    p.get_figure().savefig("output/matplotlib_plot.png")

### Save a Pandas plot

If the Pandas plot has been stored to a variable, then we first need to `get_figure()` and only then savefig() will do the job.

Gory Details: This is because `df.plot()` saves it to an `AxesSubplot` type of object. Those cannot be directly saved. We first get the parent figure for the `AxesSubplot`, and then we can easily save it using `savefig`

In [83]:
fig = pandas_plot.get_figure()
fig.savefig ("output/Pandas.png")

In [85]:
#for the really curious
type(pandas_plot)

matplotlib.axes._subplots.AxesSubplot

### Save a `Seaborn` Plot

In [86]:
seaborn_plot.savefig("output/seaborn_line_plot.png")

# Take Away

If you are paying attention, you would have already noticed the common function in all 3 types of plots. To save the figures, we just use one command: `savefig()`.

It is just that we had to make sure that we had the `Figure` object identified, before we could use the `savefig()` method on it.

![Questions](images/questions.png)